### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.pushnotif_rc_cosmosdb_account_api["cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "pushnotif_rc_cosmosdb_account_api" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.pushnotif_rc_cosmosdb_account_api["e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "pushnotif_rc_cosmosdb_account_api" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.pushnotif_rc_io_com_cosmos["cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "pushnotif_rc_io_com_cosmos" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.pushnotif_rc_io_com_cosmos["e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "pushnotif_rc_io_com_cosmos" {
      + account_name        = "io-p-itn-com-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"
      + resource_group_name = "io-p-itn-com-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
    }

  # module.web_apps.azurerm_role_assignment.pushnotif_rc_cosmosdb_account_api_contributor["cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"] will be created
  + resource "azurerm_role_assignment" "pushnotif_rc_cosmosdb_account_api_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.pushnotif_rc_cosmosdb_account_api_contributor["e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"] will be created
  + resource "azurerm_role_assignment" "pushnotif_rc_cosmosdb_account_api_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.pushnotif_rc_io_com_cosmos_contributor["cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"] will be created
  + resource "azurerm_role_assignment" "pushnotif_rc_io_com_cosmos_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cdfbc1ba-993d-46f4-bf2d-e6d003e02aaa"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.pushnotif_rc_io_com_cosmos_contributor["e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"] will be created
  + resource "azurerm_role_assignment" "pushnotif_rc_io_com_cosmos_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e2e8d81c-5d62-4909-b4a9-acbe58e35d0f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-com-cosno-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.push_notif_function[0].azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "COSMOSDB_NAME"                                                                                    = "db"
          + "COSMOSDB_URI"                                                                                     = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "MESSAGE_CONTAINER_NAME"                                                                           = "message-content"
          + "MESSAGE_CONTENT_STORAGE_CONNECTION_STRING"                                                        = (sensitive value)
          + "REMOTE_CONTENT_COSMOSDB_NAME"                                                                     = "remote-content-cosmos-01"
          + "REMOTE_CONTENT_COSMOSDB_URI"                                                                      = "https://io-p-itn-com-cosno-01.documents.azure.com:443/"
          + "REMOTE_CONTENT_COSMOSDB__accountEndpoint"                                                         = "https://io-p-itn-com-cosno-01.documents.azure.com:443/"
          + "SESSION_MANAGER_API_KEY"                                                                          = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=session-manager-api-key)"
          + "SESSION_MANAGER_BASE_URL"                                                                         = "https://io-p-weu-auth-sm-int-func-01.azurewebsites.net"
            # (46 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-pushnotif-func-01"
        name                                           = "io-p-itn-com-pushnotif-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.push_notif_function[0].azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "COSMOSDB_NAME"                                                                                    = "db"
          + "COSMOSDB_URI"                                                                                     = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "MESSAGE_CONTAINER_NAME"                                                                           = "message-content"
          + "MESSAGE_CONTENT_STORAGE_CONNECTION_STRING"                                                        = (sensitive value)
          + "REMOTE_CONTENT_COSMOSDB_NAME"                                                                     = "remote-content-cosmos-01"
          + "REMOTE_CONTENT_COSMOSDB_URI"                                                                      = "https://io-p-itn-com-cosno-01.documents.azure.com:443/"
          + "REMOTE_CONTENT_COSMOSDB__accountEndpoint"                                                         = "https://io-p-itn-com-cosno-01.documents.azure.com:443/"
          + "SESSION_MANAGER_API_KEY"                                                                          = "@Microsoft.KeyVault(VaultName=io-p-itn-com-kv-01;SecretName=session-manager-api-key)"
          + "SESSION_MANAGER_BASE_URL"                                                                         = "https://io-p-weu-auth-sm-int-func-01.azurewebsites.net"
            # (47 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-pushnotif-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.services_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-services-func-01"
        name                                           = "io-p-itn-com-services-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (34 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
              - "APPINSIGHTS_SAMPLING_PERCENTAGE",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
                "SLOT_TASK_HUBNAME",
                "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
                "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
                "AzureWebJobs.CreateNotification.Disabled",
                # (4 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 8 to add, 3 to change, 0 to destroy.
```

</details>
